
## Date ##
//--- new Date() - Создает объект Date с текущей датой и временем. -----------------------------+
//--- new Date(milliseconds) - созд объект, количество миллс с 1 янв 1970г. --------------------+
//--- UTC. -------------------------------------------------------------------------------------+
//--- Разница в UTC в минутах. -----------------------------------------------------------------+
//--- setHours, с одним и несколькими параметрами. ---------------------------------------------+
//--- Автоисправления. -------------------------------------------------------------------------+
//--- Преоброзование даты к числу --------------------------------------------------------------+
//--- Работа с вычислением даты из даты. -------------------------------------------------------+
//--- Форматирование дат. ----------------------------------------------------------------------+
//--- ISO. -------------------------------------------------------------------------------------+
//--- z. Дни недели 'вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'. ----------------------------------+
//--- z. День указанное количество дней назад. -------------------------------------------------+
//--- z. Последнее число месятца. --------------------------------------------------------------+
//--- Сколько секунд уже прошло сегодня? -------------------------------------------------------+
//--- Сколько секунд - до завтра? --------------------------------------------------------------+
//--- Вывести дату в формате дд.мм.гг. ---------------------------------------------------------+
//--- Относительное форматирование даты. -------------------------------------------------------+

	//--- new Date() - Создает объект Date с текущей датой и временем. -----------------------------+
		var now = new Date();
		alert( now );
		new Date(2011, 0, 1, 0, 0, 0, 0); // // 1 января 2011, 00:00:00
		new Date(2011, 0, 1); // то же самое, часы/секунды по умолчанию равны 0
	
	//--- new Date(milliseconds) - созд объект, количество миллс с 1 янв 1970г. --------------------+
		// 24 часа после 01.01.1970 GMT+0
		var Jan02_1970 = new Date(3600 * 24 * 1000);
		alert( Jan02_1970 );
	
	//--- UTC. -------------------------------------------------------------------------------------+
		// текущая дата
		var date = new Date();
		// час в текущей временной зоне
		alert( date.getHours() );
		// сколько сейчас времени в Лондоне?
		// час в зоне GMT+0
		alert( date.getUTCHours() );
	
	//--- Разница в UTC в минутах. -----------------------------------------------------------------+
		alert( new Date().getTimezoneOffset() ); // Для GMT-1 выведет 60
	
	//--- setHours, с одним и несколькими параметрами. ---------------------------------------------+
		var today = new Date;
		today.setHours(0); 
		console.log(today); // сегодня, но час изменён на 0
		today.setHours(0, 0, 0, 0);
		console.log(today); // сегодня, ровно 00:00:00.
	
	//--- Автоисправления. -------------------------------------------------------------------------+
		var d = new Date(2013, 0, 32); // 32 января 2013 ?!?
		alert(d); // ... это 1 февраля 2013!
		//-
		var d = new Date();
		d.setSeconds(d.getSeconds() + 70);
		alert( d ); // выведет корректную дату
		//-
		var d = new Date;
		d.setDate(1); // поставить первое число месяца
		alert( d );
		d.setDate(0); // нулевого числа нет, будет последнее число предыдущего месяца
		alert( d );
	
	//--- Преоброзование даты к числу --------------------------------------------------------------+
		alert(+new Date) // +date то же самое, что: +date.valueOf()
	
	//--- Работа с вычислением даты из даты. -------------------------------------------------------+
		var start = new Date; // засекли время
		// что-то сделать
		for (var i = 0; i < 100000; i++) {
		  var doSomething = i * i * i;
		}
		var end = new Date; // конец измерения
		alert( "Цикл занял " + (end - start) + " ms" );
	
	//--- Форматирование дат. ----------------------------------------------------------------------+
		var date = new Date(2014, 11, 31, 12, 30, 0);

		var options = {
		  era: 'long',
		  year: 'numeric',
		  month: 'long',
		  day: 'numeric',
		  weekday: 'long',
		  timezone: 'UTC',
		  hour: 'numeric',
		  minute: 'numeric',
		  second: 'numeric'
		};
		// среда, 31 декабря 2014 г. н.э. 12:30:00
		alert( date.toLocaleString("ru", options) ); 
		// Wednesday, December 31, 2014 Anno Domini 12:30:00 PM
		alert( date.toLocaleString("en-US", options) ); 
	
	//--- ISO. -------------------------------------------------------------------------------------+
		var d = new Date();
		// вывод, похожий на '2011-01-26T13:51:50.417Z'
		alert( d.toISOString() ); 
	
	//--- z. Дни недели 'вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'. ----------------------------------+
		//1 способ
		function getWeekDay(date) {
		  var days = ['вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'];

		  return days[date.getDay()];
		}
		var date = new Date(2014, 0, 3); // 3 января 2014
		alert( getWeekDay(date) ); // 'пт'

		//2способ
		var date = new Date(2014, 0, 3); // 3 января 2014
		alert( date.toLocaleString('ru', {weekday: 'short'}) ); // 'Пт'	
	
	//--- z. День указанное количество дней назад. -------------------------------------------------+
		function getDateAgo(date, days) {
		  var dateCopy = new Date(date);

		  dateCopy.setDate(date.getDate() - days);
		  return dateCopy.getDate();
		}

		var date = new Date(2015, 0, 2);

		console.log( getDateAgo(date, 1) ); // 1, (1 января 2015)
		console.log( getDateAgo(date, 2) ); // 31, (31 декабря 2014)
		console.log( getDateAgo(date, 365) ); // 2, (2 января 2014)
	
	//--- z. Последнее число месятца. --------------------------------------------------------------+
		function getLastDayOfMonth(year, month) {
		  var date = new Date(year, month + 1, 0);
		  return date.getDate();
		}

		console.log( getLastDayOfMonth(2012, 0) ); // 31
		console.log( getLastDayOfMonth(2012, 1) ); // 29
		console.log( getLastDayOfMonth(2013, 1) ); // 28

	//--- Сколько секунд уже прошло сегодня? -------------------------------------------------------+		function getSecondsToday() {
		  var d = new Date();
		  return d.getHours() * 3600 + d.getMinutes() * 60 + d.getSeconds();
		};
	
	//--- Сколько секунд - до завтра? --------------------------------------------------------------+
		/* 
		Для получения оставшихся до конца дня миллисекунд нужно из «завтра 00 ч 00 мин 00 сек» 
		вычесть текущее время.
		*/
		function getSecondsToTomorrow() {
			var now = new Date();

		  	// создать объект из завтрашней даты, без часов-минут-секунд
		  	var tomorrow = new Date(now.getFullYear(), now.getMonth(), now.getDate()+1);

		  	var diff = tomorrow - now; // разница в миллисекундах
		  	return Math.round(diff / 1000); // перевести в секунды
		}
	
	//--- Вывести дату в формате дд.мм.гг. ---------------------------------------------------------+
		function formatDate(date) {

		  var dd = date.getDate();
		  if (dd < 10) dd = '0' + dd;

		  var mm = date.getMonth() + 1;
		  if (mm < 10) mm = '0' + mm;

		  var yy = date.getFullYear() % 100;
		  if (yy < 10) yy = '0' + yy;

		  return dd + '.' + mm + '.' + yy;
		}

		var d = new Date(2014, 0, 30); // 30 Янв 2014
		alert( formatDate(d) ); // '30.01.14'
	
	//--- Относительное форматирование даты. -------------------------------------------------------+
		/*
		Выводит сообщения в зависимости сколько времени прошло
		*/
		function formatDate(date) {
		  var diff = new Date() - date; // разница в миллисекундах

		  if (diff < 1000) { // прошло менее 1 секунды
		    return 'только что';
		  }

		  var sec = Math.floor(diff / 1000); // округлить diff до секунд

		  if (sec < 60) {
		    return sec + ' сек. назад';
		  }

		  var min = Math.floor(diff / 60000); // округлить diff до минут
		  if (min < 60) {
		    return min + ' мин. назад';
		  }

		  // форматировать дату, с учетом того, что месяцы начинаются с 0
		  var d = date;
		  d = [
		    '0' + d.getDate(),
		    '0' + (d.getMonth() + 1),
		    '' + d.getFullYear(),
		    '0' + d.getHours(),
		    '0' + d.getMinutes()
		  ];

		  for (var i = 0; i < d.length; i++) {
		    d[i] = d[i].slice(-2);
		  }

		  return d.slice(0, 3).join('.') + ' ' + d.slice(3).join(':');
		}
		// только что
		alert( formatDate(new Date(new Date - 1)) ); 
		// 30 сек. назад
		alert( formatDate(new Date(new Date - 30 * 1000)) ); 
		// 5 мин. назад
		alert( formatDate(new Date(new Date - 5 * 60 * 1000)) ); 
		// вчерашняя дата в формате "дд.мм.гг чч:мм"
		alert( formatDate(new Date(new Date - 86400 * 1000)) ); 