//--- Условие | @if @else ------------------------------------------------------------------------+
	var x=100;
	if (x > 100) {
		console.log("X больше 100");
	} else if (x < 100) {
		console.log("X меньше 100"); 
	} else if (x == 100) {
		console.log("X равняется 100");
	}
//--- Тернарный оператор | @? --------------------------------------------------------------------+
	var age = prompt('возраст?', 18);
	var message = (age < 3) ? 'Здравствуй, малыш!' :
	  (age < 18) ? 'Привет!' :
	  (age < 100) ? 'Здравствуйте!' :
	  'Какой необычный возраст!';
	alert( message );
//--- Поддерживаются 3 вида циклов. | @while @do...while @for ------------------------------------+
	// 1) while
	while (условие) {
	  ...
	}
	// 2) do…while
	do {
	  ...
	} while (условие);

	// 3) for
	for (var i = 0; i < 10; i++) {
	  ...
	}
//--- Метки для прерывания циклов. | @for+метка --------------------------------------------------+
	outer:
	for(;;) {
	    ...
	  for(;;) {
	    ...
	    break outer;
	  }
	}
//--- Простой бесконечный цикл. ------------------------------------------------------------------+
	while (true) {
	  // ...
	}
//--- Конструкция switch. | @switch --------------------------------------------------------------+
	var a = 2 + 2;
	switch (a) {
	  case 3:
	    alert( 'Маловато' );
	    break;
	  case 4:
	    alert( 'В точку!' );
	    break;
	  case 5:
	    alert( 'Перебор' );
	    break;
	  default:
	    alert( 'Я таких значений не знаю' );
	}



